<template>
  <div class="root">
    <div class="policy-close" @click="policyBtn"></div>
    <div id="policy">
      <h2>隐私政策设置说明</h2>

      <h3>一、法律声明</h3>
      <ol>
        <li>
          在使用本平台各项服务前，请您务必仔细阅读并透彻理解本声明。如对本声明内容有任何疑问，您可向咨询。阅读本声明的过程中，如果您不同意本声明或其中任何内容，您应立即停止使用手机号码验证服务。如果您继续使用本平台服务，即意味着您认可本声明全部内容。
        </li>
        <li>
          本平台各项电子服务的知识产权所有权和运作权归属河北中烟工业有限责任公司（以下简称本公司）所有。本协议构成您与本平台之间就您使用系统达成的协议，具有法律效力。本协议的最终解释权归河北中烟所有。
        </li>
      </ol>

      <h3>二、用户的权利和义务</h3>
      <p>
        所有用户必须遵循：
      </p>
      <ol>
        <li>
          • 遵守所有使用服务的协议、规定、程序和惯例；
        </li>
        <li>
          • 不得使用本系统从事违法活动；
        </li>
        <li>
          • 不得干扰或侵犯本系统的正常运行和其他用户的正常使用；
        </li>
        <li>
          同时用户承诺：
        </li>
        <li>
          •
          不得传输任何非法的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的、淫秽的信息；
        </li>
        <li>
          • 不得传输任何教唆他人进行违法犯罪行为的资料；
        </li>
        <li>
          • 不得传输不利于国内团结和社会安定的资料；
        </li>
        <li>
          • 不得传输任何不符合国家法律、法规规定的资料、信息；
        </li>
        <li>
          • 不得未经书面许可，将系统所载信息进行复制及进行网络传播；
        </li>
        <li>
          如果用户的行为违背上述条款规定，河北中烟可以做出独立判断并有权立即取消用户资格。用户应对自己在网上的违法行为承担全部法律责任。
        </li>
        <li>基于网络服务的特殊性，用户同意：</li>
        <li>
          •
          在注册时按照注册提示提供准确的手机号及个人资料。用户注册时需要至少向我们提供用户本人的手机号码，我们将通过发送短信验证码的方式来验证用户的身份是否有效，用户的账户名默认为用户的微信默认昵称。
        </li>
        <li>
          •
          在个人的注册信息发生变化时，用户应及时更新自己的注册信息，保证其个人资料的详尽和准确。所有用户输入的个人信息将被视作准确表明了用户的身份，并作为本系统提供所有服务的有效身份依据。
        </li>
        <li>
          •
          用户一旦注册成功，成为系统的正式用户后，应当对自己的微信平台账号安全性负全部责任。对于用户因微信帐号泄露造成本系统平台的各种损失，河北中烟不承担任何责任。用户发现任何非法使用本系统账号的情况，应立即通知河北中烟。
        </li>
        <li></li>
        <li></li>
        <li></li>
        <li></li>
        <li></li>
        <li></li>
        <li></li>
        <li></li>
      </ol>

      <h3>三、隐私权政策</h3>
      <p>
        我们非常重视您的隐私和个人信息保护。在您使用我们的产品与/或服务时，我们将按照本隐私权政策收集、使用及共享您的个人信息。我们希望通过《平台隐私政策（“本隐私政策”）向您说明我们在您使用我们的产品与/或服务时如何收集、使用、保存这些信息，以及我们为您提供的访问、更新、删除和保护这些信息的方式。如果您不同意本隐私政策的任何内容，您应立即停止使用手机验证服务。如您继续使用我们提供的任一服务时，即表示您已同意我们按照本隐私政策照来合法收集、使用和分享您的相关信息。
      </p>
      <ol>
        <li class="subTitle">1、我们如何收集信息</li>
        <li>我们收集信息是为了向您提供优质的服务，我们收集信息的方式如下：</li>
        <li>
          (1)您向我们提供的信息。当您注册账户及您在使用系统时提供的相关服务时填写及或提交的信息，包括但不限于手机号、您的姓名、性别、出生年月日、身份证号码、电话号码、电子邮箱、地址、邮编、银行账号等相关信息。
        </li>
        <li>
          (2)在您使用服务过程中收集的信息。为了提供并优化您需要的服务，我们会收集您使用服务的相关信息，这类信息包括：在您使用移动设备访问系统服务时，可能会读取与您位置和移动设备相关的信息，包括但不限于定位位置信息、设备型号、操作系统、设备识别码、分辨率、电信运营商等。
        </li>
        <li>
          (3)来自第三方的信息。为了给您提供更好、更优、更加个性化的服务，或共同为您提供服务，或为了预防互联网欺诈的目的，河北中烟的关联方、合作伙伴会依据法律的规定或与您的约定或征得您同意的前提下，分享您的个人信息。
          您了解并同意，以下信息不适用本隐私权政策：
          a）您在系统进行交易的有关数据，包括但不限于出价、成交信息及评价等数据；
          b）您在使用系统提供的搜索服务时输入的关键字信息；
          c）信用评价、违反法律规定或违反规则行为及已对您采取的措施； d)
          应法律法规要求需公示的企业名称等相关工商注册信息以及自然人经营者的信息。
        </li>
        <li class="subTitle">
          2、我们如何使用信息
        </li>
        <li>
          收集的有关您的信息和资料将保存在河北中烟及（或）关联公司的服务器上，是为了向您提供优质服务的目的，为了实现该目的，我们会把您的信息用于下列用途：
        </li>
        <li>(1)向您提供您使用的各项服务，并维护、改进这些服务。</li>
        <li>
          (2)我们可能使用您的个人信息以预防、发现、调查欺诈、危害安全、非法或违反与我们或其关联方协议、政策或规则的行为，以保护您、其他我们用户，或我们或其关联方的合法权益。
        </li>
        <li>
          (3)我们可能会将来自某项服务的个人信息与来自其他服务的信息结合起来，用于为了给您提供更加个性化的服务使用，例如让您拥有更广泛的社交圈的需要而使用、共享或披露，或给您提供更便捷的消费者服务体验。
        </li>
        <li>(4)经您许可的其他用途。</li>
        <li class="subTitle">3、我们如何共享信息</li>
        <li>
          我们对您的信息承担保密义务，不会为满足第三方的营销目的而向其出售或出租您的任何信息，我们会在下列情况下才将您的信息与第三方共享：
        </li>
        <li>(1)事先获得您的同意或授权。</li>
        <li>(2)根据法律法规的规定或行政或司法机构的要求。</li>
        <li>(3)向关联方分享您的个人信息。</li>
        <li>
          (4)向可信赖的合作伙伴提供您的个人信息，让他们根据我们的指示并遵循我们的隐私权政策以及其他任何相应的保密和安全措施来为我们处理这些信息。
        </li>
        <li>
          (5)如您出现违反中国有关法律、法规或者相关协议或相关规则的情况，需要向第三方披露。
        </li>
        <li>(6)为维护及其关联方或用户的合法权益。</li>
      </ol>

      <h3>四、公民个人信息保护</h3>
      <p>
        为保障您的信息安全，我们努力采取各种合理的安全措施来保护您的信息，以防信息的泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制。我们对可能接触到您的信息的员工或外包人员也采取了严格管理，包括但不限于与他们签署保密协议，根据岗位的不同采取不同的权限控制，监控他们的操作情况等措施。请妥善保管您的账户及密码信息。河北中烟将通过向其它服务器备份、对用户身份信息进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但也请您理解，由于技术的限制以及可能存在的各种恶意行为，在互联网上不能保证百分之百的安全。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供，并且对此行为产生的后果承担责任。在您使用我们的服务时所提供、上传、或发布的内容和信息（比如照片），可能会泄露您的敏感个人信息，请您慎重考虑是否在使用使披露。如您发现自己的个人信息泄密，尤其是你的微信平台账户发生泄露，请您立即联络河北中烟平台，以便采取相应措施。
      </p>
      <!--<div>
            <button type="button" id="back" @click="policyClose">返回</button>
        </div>-->
    </div>
  </div>
</template>

<script lang="ts">
import { defineComponent } from 'vue'

export default defineComponent({
  setup(props, ctx) {
    const policyBtn = () => {
      ctx.emit('policyClose')
    }
    return {
      policyBtn
    }
  }
})
</script>

<style lang="scss" scoped>
* {
  box-sizing: border-box;
  margin: 0;
  padding: 0;
}
.root {
  width: 325px;
  height: 450px;
  background: #fcf8f8;
  padding: 15px;
  transform: translateX(-50%) translateY(-50%);
  border-radius: 0.26667rem;
  position: fixed;
  left: 50%;
  top: 47%;
  z-index: 9999;
  .policy-close {
    width: 23px;
    height: 23px;
    position: absolute;
    left: 50%;
    bottom: -43px;
    transform: translateX(-50%);
    background: url('https://qrmkt.oss-cn-beijing.aliyuncs.com/common/phone/phone_close.png')
      no-repeat center / contain;
  }
}

#policy {
  width: 100%;
  height: 100%;
  overflow-y: auto;
  overflow-x: hidden;
  h2 {
    color: #0085da;
    font-size: 20px;
    margin-bottom: 15px;
    text-align: center;
  }
  p,
  h3,
  li {
    color: #141000;
    font-size: 12px;
    line-height: 30px;
    text-indent: 2em;
  }
  h3 {
    font-weight: bold;
    margin-top: 5px;
  }
  #back {
    width: 101px;
    height: 32px;
    background: none;
    border: 1px solid #0085da;
    color: #0085da;
    font-size: 18px;
    display: block;
    letter-spacing: 10px;
    text-indent: 10px;
    margin: 25px auto 0;
  }
  .subTitle {
    text-indent: 0;
  }
}
</style>
